import { useState } from 'react'
import reactLogo from './assets/react.svg'
import viteLogo from '/vite.svg'
import './App.css'

function App() {
  const [count, setCount] = useState(0)

  return (
    <>
<h1>Початок 2010</h1>
<img src="https://upload.wikimedia.org/wikipedia/uk/e/e1/%D0%9F%D0%BE%D1%87%D0%B0%D1%82%D0%BE%D0%BA_%D1%84%D1%96%D0%BB%D1%8C%D0%BC%2C_2010.jpg" alt="logo" />
<p width="8em" >«Початок» (англ. «Inception») — науково-фантастичний трилер 2010 року сценариста та режисера Крістофера Нолана, який також продюсував фільм разом зі своєю дружиною Еммою Томас[4][5][6]. У фільмі Леонардо Ді Капріо грає професійного злодія, який краде інформацію, проникаючи у підсвідомість своїх цілей. Йому пропонують шанс стерти свою кримінальну історію як плату за імплантацію ідеї іншої людини у підсвідомість мішені[7]. Акторський ансамбль включає Кена Ватанабе, Джозефа Гордона-Левітта, Маріон Котіяр, Елліота Пейджа, Тома Гарді, Діліп Рао, Кілліана Мерфі, Тома Беренджера та Майкла Кейна.

Після завершення «Безсоння» у 2002 році Нолан представив Warner Bros. письмову 80-сторінкову обробку фільму жахів про «викрадачів снів», засновану на свідомих сновидіннях[8]. Вирішивши, що йому потрібен додатковий досвід, перш ніж братися за виробництво такого масштабу та складності, Нолан відклав проєкт та замість цього працював над фільмами «Бетмен: Початок» (2005), «Престиж» (2006) і «Темний лицар» (2008)[9]. «Початок» переглядався протягом шести місяців, і його купили Warner у лютому 2009 року[10]. Фільм знімався у шести країнах, починаючи з Токіо 19 червня й закінчуючи Канадою 22 листопада[11]. Офіційний бюджет склав 160 мільйонів доларів, розділених між Warner Bros. та Legendary Pictures[12]. Репутація Нолана та успіх фільму «Темний лицар» допомогли отримати 100 мільйонів доларів США на рекламу фільму.</p>
    </>
  )
}

export default App
