import { useState } from 'react'
import reactLogo from './assets/react.svg'
import viteLogo from '/vite.svg'
import './App.css'

function App() {
  const [count, setCount] = useState(0)

  return (
    <>
    <img src="https://kor.ill.in.ua/m/610x385/2481476.jpg" alt="photo" />
      <h1>Брюс Вілліс</h1>
      <p>Брюс Ві́лліс, повне ім'я Во́лтер Брюс Ві́лліс (англ. Walter Bruce Willis МФА: [ˈwɔːltɚ ˈbruːs ˈwɪlɪs] Во́лтер Бру́с Ви́лис; нар. 19 березня 1955, Ідар-Оберштайн, Біркенфельд, Рейнланд-Пфальц, ФРН) — американський кіноактор. Найбільш відомий роллю Джона Макклейна у серії фільмів «Міцний горішок», і ролями у фільмах: «Останній бойскаут» (1991), «12 мавп» (1995), «П'ятий елемент» (1997), «Армагеддон» (1998), «Шосте чуття» (1999), «Невразливий» (2000), «Місто гріхів» (2005), «Петля часу» (2012). Дворазовий лауреат прайм-тайм премії «Еммі», кавалер французького ордена Мистецтв та літератури.</p>
    </>
  )
}

export default App
