import { useState } from 'react'
import reactLogo from './assets/react.svg'
import viteLogo from '/vite.svg'
import './App.css'

function App() {
  const [count, setCount] = useState(0)

  return (
    <>
      <h1>1984</h1>
      <h2>Джо́рдж О́рвел</h2>
      <img src="https://upload.wikimedia.org/wikipedia/uk/thumb/8/8c/Dzhordzh_Orwell_-_1984_%28Ukrainian_edition%2C_2015%29.jpg/330px-Dzhordzh_Orwell_-_1984_%28Ukrainian_edition%2C_2015%29.jpg" alt="logo" />
      <p>«1984» (відомий також під назвою «Одна тисяча дев'ятсот вісімдесят четвертий») — роман-антиутопія та повість-застереження англійського письменника Джорджа Орвелла, написаний 1948 року й опублікований 8 червня 1949 року видавництвом Secker & Warburg як дев'ята й остання книга Орвелла, написана за його життя. Назва роману утворена від «перевернутого» року його написання — 1948 (у назві роману цифри 4 і 8 переставлені місцями). Тематично він зосереджений на наслідках тоталітаризму, масового стеження та репресивного регулювання людей і поведінки в суспільстві.[1][2] Орвелл, демократичний соціаліст, змоделював авторитарну державу в романі про Радянський Союз в епоху сталінізму та нацистської Німеччини.[3] У більш широкому плані роман досліджує роль правди та фактів у суспільстві та способи, якими ними можна маніпулювати.

Роман розповідає історію Вінстона Сміта і його деградації під впливом[4] тоталітарної держави, у якій він живе. Є найвідомішою і найцитованішою антиутопією у літературі й стоїть в одному ряду з «Прекрасним новим світом» (англ. Brave new world) Олдоса Гакслі і «451° за Фаренгейтом» Рея Бредбері.</p>
    </>
  )
}

export default App
